//***********************************************************************************
//	テクスチャ	[texture.h]
//	Author : 管原 司
//***********************************************************************************
#ifndef _TEXTURE_H_
#define _TEXTURE_H_
//***********************************************************************************
// インクルードファイル
//***********************************************************************************
//***********************************************************************************
// マクロ定義
//***********************************************************************************
#include "main.h"
//***********************************************************************************
// クラス
//***********************************************************************************
class CTexture
{
public:
	CTexture();
	~CTexture();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	LPDIRECT3DTEXTURE9 GetTexture(int TexNum);
	int GetTexNum(void) { return m_nNumTex; }
private:
	void Load(void);
	LPDIRECT3DTEXTURE9 m_pTexture;		// テクスチャ
	LPDIRECT3DTEXTURE9 *m_pLoadTexture;	// 読み込み用テクスチャ
	int m_nNumTex;						// テクスチャ数
};
#endif