//******************************************************************************
// タイトル [title.h]
// Author : 管原 司
//******************************************************************************
#ifndef _TITLE_H_
#define _TITLE_H_
#include "mode.h"
//******************************************************************************
// マクロ定義
//******************************************************************************
#define TITLE_WAIT_COUNT	(10)	// タイトルカウント
#define MAX_TITLE_TEX		(2)		// タイトルテクスチャ
#define MAX_TITLE			(2)		// タイトル最大数
//******************************************************************************
// クラス
//******************************************************************************
class CTitle : public CMode
{
public:
	
	CTitle();
	~CTitle();
	HRESULT Init();
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	bool m_bfade;	// フェード用のbool変数
};
#endif