//******************************************************************************
// リザルト [result.h]
// Author : 管原 司
//******************************************************************************
#ifndef _RESULT_H_
#define _RESULT_H_
//******************************************************************************
// インクルードファイル
//******************************************************************************
#include "mode.h"
//******************************************************************************
// 前方宣言
//******************************************************************************
class CScene2d;
class CPlayerdata;
//******************************************************************************
// クラス
//******************************************************************************
class CResult : public CMode
{
public:
	CResult();
	~CResult();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	static CPlayerdata * GetPlayerData(void) { return m_pPlayerData; }
private:
	static CPlayerdata * m_pPlayerData;		// プレイヤーデータ
	bool m_bfade;							// フェード用のbool変数
};
#endif