//******************************************************************************
// 床[floor.h]
// Author : 管原司
//******************************************************************************
#ifndef _FLOOR_H_
#define _FLOOR_H_
//******************************************************************************
// インクルードファイル
//******************************************************************************
#include "scene3d.h"
//******************************************************************************
// 前方宣言
//******************************************************************************

//******************************************************************************
// クラス
//******************************************************************************
class CFloor : public CScene3d
{
public:
	CFloor(int nPriority = OBJTYPE_FLOOR);
	~CFloor();
	static HRESULT Load(void);
	static void Unload(void);
	static CFloor *Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 size, D3DXCOLOR col);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	static LPDIRECT3DTEXTURE9 m_pTexture;		// テクスチャへのポインタ
};
#endif