//=============================================================================
//
// チュートリアル背景 [bg_tutorial.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include <stdio.h>
#include <stdlib.h>
#include "main.h"
#include "manager.h"
#include "renderer.h"
#include "bg_tutorial.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TEXTURE_PASS ("Data/Texture/tutorial_bg.png")
#define POSITION (D3DXVECTOR3(SCREEN_WIDTH/2,SCREEN_HEIGHT/2,0.0f))
#define SIZE (D3DXVECTOR3(SCREEN_WIDTH,SCREEN_HEIGHT,0.0f))

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************
LPDIRECT3DTEXTURE9 CTutorialBG::m_pTexture;	//テクスチャのポインタ

											//=============================================================================
											// コンストラクタ
											//=============================================================================
CTutorialBG::CTutorialBG()
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CTutorialBG::~CTutorialBG()
{
}

//=============================================================================
// テクスチャ読み込み関数
//=============================================================================
HRESULT CTutorialBG::TextureLoad(void)
{
	//レンダラーの取得
	CRenderer *pRenderer = CManager::GetRenderer();
	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();
	// テクスチャの生成
	D3DXCreateTextureFromFile(pDevice,	// デバイスへのポインタ
		TEXTURE_PASS,					// ファイルの名前
		&m_pTexture);					// 読み込むメモリー
	return S_OK;
}

//=============================================================================
// テクスチャ破棄関数
//=============================================================================
void CTutorialBG::TextureUnload(void)
{
	// テクスチャの破棄
	if (m_pTexture != NULL)
	{
		//テクスチャの破棄処理関数呼び出し
		m_pTexture->Release();
		//テクスチャをNULLにする
		m_pTexture = NULL;
	}
}

//=============================================================================
// 生成処理関数呼び出し
//=============================================================================
CTutorialBG * CTutorialBG::Create()
{
	//チュートリアル背景のポインタ
	CTutorialBG * pTutorialBG = NULL;
	//チュートリアル背景のポインタがNULLの場合
	if (pTutorialBG == NULL)
	{
		//チュートリアル背景のメモリ確保
		pTutorialBG = new CTutorialBG;
		//チュートリアル背景のポインタがNULLではない場合
		if (pTutorialBG != NULL)
		{
			//チュートリアル背景の位置設定
			pTutorialBG->SetPosition(POSITION);
			//チュートリアル背景のサイズ設定
			pTutorialBG->SetSize(SIZE);
			//チュートリアル背景の初期化処理関数呼び出し
			pTutorialBG->Init();
		}
	}
	//チュートリアルロゴのボタンのポインタを返す
	return pTutorialBG;
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CTutorialBG::Init(void)
{
	//テクスチャのUV座標の設定
	D3DXVECTOR2 aTexture[NUM_VERTEX];
	aTexture[0] = D3DXVECTOR2(0.0f, 0.0f);
	aTexture[1] = D3DXVECTOR2(1.0f, 0.0f);
	aTexture[2] = D3DXVECTOR2(0.0f, 1.0f);
	aTexture[3] = D3DXVECTOR2(1.0f, 1.0f);
	//ボタンの初期化処理関数呼び出し
	CScene2d::Init();
	//テクスチャの設定
	SetTexture(aTexture);
	//テクスチャの割り当て
	BindTexture(m_pTexture);
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CTutorialBG::Uninit(void)
{
	//ボタンの終了処理関数呼び出し
	CScene2d::Uninit();
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CTutorialBG::Update(void)
{
	//ボタンの更新処理関数呼び出し
	CScene2d::Update();
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CTutorialBG::Draw(void)
{
	//ボタンの描画処理関数呼び出し
	CScene2d::Draw();
}