//=============================================================================
//
// フェード [fade.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _UI_BOMB_H_
#define _UI_BOMB_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "manager.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define FADE_RATE (0.1f)

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CFade
{
public:
	typedef enum
	{
		FADE_NONE = -1,
		FADE_IN,
		FADE_OUT,
		FADE_MAX
	}FADE;
	CFade();
	~CFade();
	static CFade * Create(CManager::MODE mode);
	HRESULT Init(CManager::MODE mode);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuff;	//頂点バッファ
	D3DXVECTOR3 m_Position;				//位置
	D3DXVECTOR3 m_Size;					//サイズ
	D3DXCOLOR m_Color;					//色
	FADE m_fade;						//フェード
	CManager::MODE m_ModeNext;			//次のモード
};
#endif