//******************************************************************************
// プレイヤービーム [player_beam.h]
// Author : 管原　司
//******************************************************************************
#ifndef _PLAYER_BEAM_H_
#define _PLAYER_BEAM_H_
//******************************************************************************
// インクルードファイル
//******************************************************************************

//******************************************************************************
// マクロ定義
//******************************************************************************
#define BEAM_MAX_NUM	(2)	// 数
//******************************************************************************
// 前方宣言
//******************************************************************************
class CBeam;
//******************************************************************************
// クラス
//******************************************************************************
class CPlayer_Beam : public CScene
{
public:
	CPlayer_Beam(int nPriority = OBJTYPE_PLAYER_BULLET);
	~CPlayer_Beam();

	static CPlayer_Beam *Create(D3DXVECTOR3 pos, D3DXVECTOR3 size);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	void BeamCreate(D3DXVECTOR3 pos, D3DXVECTOR3 size);
	void ReleaseAllBeam(void);
private:
	void Collision(void);
	D3DXVECTOR3 m_pos;						// 位置
	D3DXVECTOR3 m_size;						// サイズ
	CBeam *m_apBeam[BEAM_MAX_NUM];			// CBeamクラスのポインタ
};
#endif