//******************************************************************************
// フェード [fade.cpp]
// Author : 管原　司
//******************************************************************************

//******************************************************************************
// インクルードファイル
//******************************************************************************
#include "../System/main.h"
#include "../System/manager.h"
#include "../System/renderer.h"
#include "../System/scene.h"
#include "../System/scene2d.h"
#include "polygon.h"
#include "fade.h"
//******************************************************************************
// マクロ定義
//******************************************************************************
#define COLOR_RATE	(0.05f)								// a加算減算値
#define COLOR_MIN	(D3DXCOLOR(0.0f,0.0f,0.0f,0.0f))	// 色の最小値
#define	COLOR_MAX	(D3DXCOLOR(0.0f,0.0f,0.0f,1.0f))	// 色の最大値
//******************************************************************************
// コンストラクタ
//******************************************************************************
CFade::CFade(int nPriority) : CPolygon(nPriority)
{
	m_fade		= FADE_NONE;
	m_ModeNext	= CSceneManager::MODE_NONE;
}
//******************************************************************************
// デストラクタ
//******************************************************************************
CFade::~CFade()
{
}
//******************************************************************************
// 生成関数
//******************************************************************************
CFade * CFade::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, CSceneManager::MODE mode)
{
	// CFadeクラスのポインタ
	CFade * pFade;

	//メモリ確保
	pFade = new CFade;

	// モード代入
	pFade->m_ModeNext = mode;

	// 情報設定
	pFade->SetPolygon(pos, size, COLOR_MIN, TEX_TYPE_MAX);

	// オブジェクト設定
	pFade->SetObjType(OBJTYPE_FADE);

	// 初期化
	pFade->Init();

	// ポインタを返す
	return pFade;
}
//******************************************************************************
// 初期化関数
//******************************************************************************
HRESULT CFade::Init(void)
{
	// フェードイン状態に
	m_fade = FADE_IN;

	// 初期化
	CPolygon::Init();

	return S_OK;
}
//******************************************************************************
// 終了関数
//******************************************************************************
void CFade::Uninit(void)
{
	//終了
	CPolygon::Uninit();
}
//******************************************************************************
// 更新関数
//******************************************************************************
void CFade::Update(void)
{
	// 更新
	CPolygon::Update();

	// カラー取得
	D3DXCOLOR col = GetRGBA();

	//更新
	if (m_fade != FADE_NONE)
	{
		//フェードイン
		if (m_fade == FADE_IN)
		{
			//a値を加算
			col.a += COLOR_RATE;

			//画面が黒くなったら
			if (col.a >= COLOR_MAX.a)
			{
				//遷移
				CSceneManager::SetMode(m_ModeNext);

				//フェード終了処理
				col.a = COLOR_MAX.a;

				// フェードアウトに設定
				m_fade = FADE_OUT;
			}
		}
		//フェードアウト
		if (m_fade == FADE_OUT)
		{
			//α値を減算
			col.a -= COLOR_RATE;

			//画面の透過
			if (col.a <= COLOR_MIN.a)
			{
				//フェード処理切り替え
				col.a = COLOR_MIN.a;

				// 終了
				Uninit();
				return;
			}
		}
		// カラー設定
		SetRGBA(col);
	}
}
//******************************************************************************
// 描画関数
//******************************************************************************
void CFade::Draw(void)
{
	// 描画
	CPolygon::Draw();
}
