//******************************************************************************
// 黒ポリゴン [title_polygon.cpp]
// Author : 管原　司
//******************************************************************************
//******************************************************************************
// インクルードファイル
//******************************************************************************
#include "../System/main.h"
#include "../System/manager.h"
#include "../System/renderer.h"
#include "../System/scene.h"
#include "../System/scene2d.h"
#include "polygon.h"
#include "title_polygon.h"
//******************************************************************************
// コンストラクタ
//******************************************************************************
CTitle_Polygon::CTitle_Polygon(int nPriority) : CPolygon(nPriority)
{
}
//******************************************************************************
// デストラクタ
//******************************************************************************
CTitle_Polygon::~CTitle_Polygon()
{
}
//******************************************************************************
// 生成関数
//******************************************************************************
CTitle_Polygon * CTitle_Polygon::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, D3DXCOLOR col, TEX_TYPE textype)
{
	//　CTitle_Polygonクラスのポインタ
	CTitle_Polygon *pTitle_Polygon;

	// メモリ確保
	pTitle_Polygon = new CTitle_Polygon;

	// 情報設定
	pTitle_Polygon->SetPolygon(pos, size, col, textype);

	// 初期化
	pTitle_Polygon->Init();

	// ポインタを返す
	return pTitle_Polygon;

}
//******************************************************************************
// 初期化関数
//******************************************************************************
HRESULT CTitle_Polygon::Init()
{
	//　初期化
	CPolygon::Init();

	return S_OK;
}
//******************************************************************************
// 終了関数
//******************************************************************************
void CTitle_Polygon::Uninit(void)
{
	//　終了
	CPolygon::Uninit();
}
//******************************************************************************
// 更新関数
//******************************************************************************
void CTitle_Polygon::Update(void)
{
	//　更新
	CPolygon::Update();
}
//******************************************************************************
// 描画関数
//******************************************************************************
void CTitle_Polygon::Draw(void)
{
	//　描画
	CPolygon::Draw();
}