//******************************************************************************
// チュートリアルポリゴン [tutrial_polygon.cpp]
// Author : 管原　司
//******************************************************************************
//******************************************************************************
// インクルードファイル
//******************************************************************************
#include "../System/main.h"
#include "../System/manager.h"
#include "../System/renderer.h"
#include "../System/scene.h"
#include "../System/scene2d.h"
#include "polygon.h"
#include "tutrial_polygon.h"
//******************************************************************************
// コンストラクタ
//******************************************************************************
CTutrial_Polygon::CTutrial_Polygon(int nPriority) : CPolygon(nPriority)
{
}
//******************************************************************************
// デストラクタ
//******************************************************************************
CTutrial_Polygon::~CTutrial_Polygon()
{
}
//******************************************************************************
// 生成関数
//******************************************************************************
CTutrial_Polygon * CTutrial_Polygon::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size, D3DXCOLOR col, TEX_TYPE textype)
{
	//　CTitle_Polygonクラスのポインタ
	CTutrial_Polygon *pTutrial_Polygon;

	// メモリ確保
	pTutrial_Polygon = new CTutrial_Polygon;

	// 情報設定
	pTutrial_Polygon->SetPolygon(pos, size, col, textype);

	// 初期化
	pTutrial_Polygon->Init();

	// ポインタを返す
	return pTutrial_Polygon;

}
//******************************************************************************
// 初期化関数
//******************************************************************************
HRESULT CTutrial_Polygon::Init()
{
	//　初期化
	CPolygon::Init();

	return S_OK;
}
//******************************************************************************
// 終了関数
//******************************************************************************
void CTutrial_Polygon::Uninit(void)
{
	//　終了
	CPolygon::Uninit();
}
//******************************************************************************
// 更新関数
//******************************************************************************
void CTutrial_Polygon::Update(void)
{
	//　更新
	CPolygon::Update();
}
//******************************************************************************
// 描画関数
//******************************************************************************
void CTutrial_Polygon::Draw(void)
{
	//　描画
	CPolygon::Draw();
}