//******************************************************************************
// デバッグプロシージャ [debug_proc.h]
// Author : 管原　司
//******************************************************************************
#ifndef _DEBUG_H_
#define _DEBUG_H_
//******************************************************************************
// マクロ定義
//******************************************************************************
#define MAX_ASTR	(1024)
//******************************************************************************
// クラス
//******************************************************************************
class CDebugProc
{
public:
	CDebugProc();
	~CDebugProc();
	void Init(void);
	void Uninit(void);
	static void Print(char *fmt, ...);
	static void Draw(void);
private:
	static LPD3DXFONT m_pFont;
	static char m_astr[MAX_ASTR];
};
#endif // !_DEBUG_H_
