//***********************************************************************************
//	パーティクルテクスチャ	[particle_texture.h]
//	Author : 管原 司
//***********************************************************************************
#ifndef _PARTICLE_TEXTURE_H_
#define _PARTICLE_TEXTURE_H_
//***********************************************************************************
// インクルードファイル
//***********************************************************************************
//***********************************************************************************
// マクロ定義
//***********************************************************************************
#include "main.h"
//***********************************************************************************
// クラス
//***********************************************************************************
class CParticle_Texture
{
public:
	CParticle_Texture();
	~CParticle_Texture();
	HRESULT Init(void);
	void Uninit(void);
	LPDIRECT3DTEXTURE9 GetTexture(int TexNum);
	int GetTexNum(void) { return m_nNumTex; }
private:
	void Load(void);
	LPDIRECT3DTEXTURE9 m_pTexture;		// テクスチャ
	LPDIRECT3DTEXTURE9 *m_pLoadTexture;	// 読み込み用テクスチャ
	int m_nNumTex;						// テクスチャ数
};
#endif