//******************************************************************************
// ライフゲージ [life_gage.h]
// Author : 管原司
//******************************************************************************
#ifndef _LIFE_GAGE_H_
#define _LIFE_GAGE_H_
//******************************************************************************
// インクルードファイル
//******************************************************************************
#include "gage.h"
//******************************************************************************
// 前方宣言
//******************************************************************************
class CPlayer;
class CGage_Back;
//******************************************************************************
// クラス
//******************************************************************************
class CLife_Gage : public CGage
{
public:
	CLife_Gage();
	~CLife_Gage();
	static CLife_Gage *Create(D3DXVECTOR3 pos, CPlayer *pPlayer);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
private:
	CPlayer *m_pPlayer;
	CGage_Back *m_pGage_Back;
	int m_nGageNum;
};
#endif