//******************************************************************************
// ワーニング [warning.cpp]
// Author : 管原 司
//******************************************************************************

//******************************************************************************
// インクルードファイル
//******************************************************************************
#include "../System/main.h"
#include "../System/manager.h"
#include "../System/renderer.h"
#include "../System/scene.h"
#include "../System/scene2d.h"
#include "../Boss/boss.h"
#include "../Mode/game.h"
#include "warning.h"
//******************************************************************************
// マクロ定義
//******************************************************************************
#define TEXTURE				( "data/Texture/UI/warning.png")				// テクスチャ
#define BOSS_RESPAWN_COUNT	(50)											// ボス生成カウント
#define COLOR_ADD_VALUE		(0.05f)											// 色加算値
#define COLOR_MAX_VALUE		(1.0f)											// 色の最大値
#define COLOR_MIN_VALUE		(0.1f)											// 色の最小値
#define COLOR				(D3DXCOLOR(1.0f,1.0f,1.0f,1.0f))				// 色の値
//******************************************************************************
// 静的メンバ変数
//******************************************************************************
LPDIRECT3DTEXTURE9 CWarning::m_pTexture = NULL;
//******************************************************************************
// テクスチャ読み込み
//******************************************************************************
HRESULT CWarning::Load(void)
{
	//デバイス取得
	LPDIRECT3DDEVICE9 pDevice = CSceneManager::GetRenderer()->GetDevice();
	//テクスチャ読み込み
	D3DXCreateTextureFromFile(pDevice, TEXTURE, &m_pTexture);
	return S_OK;
}
//******************************************************************************
// テクスチャ破棄
//******************************************************************************
void CWarning::Unload(void)
{
	// テクスチャの破棄
	if (m_pTexture != NULL)
	{
		m_pTexture->Release();
		m_pTexture = NULL;
	}
}
//******************************************************************************
// コンストラクタ
//******************************************************************************
CWarning::CWarning(int nPriority) : CScene2d(nPriority)
{
	m_bColor		= false;
	m_nWarnigCount	= INIT_INT;
}
//******************************************************************************
// デストラクタ
//******************************************************************************
CWarning::~CWarning()
{
}
//******************************************************************************
// 生成関数
//******************************************************************************
CWarning * CWarning::Create(D3DXVECTOR3 pos, D3DXVECTOR3 size)
{
	// CWarningクラスのポインタ
	CWarning * pWarning;

	// メモリ確保
	pWarning = new CWarning;

	// 位置座標設定
	pWarning->SetPosition(pos);

	// 位置座標設定
	pWarning->SetSize(size);

	// 初期化
	pWarning->Init();

	// ポインタを返す
	return nullptr;
}

//******************************************************************************
// 初期化関数
//******************************************************************************
HRESULT CWarning::Init(void)
{
	// カラー設定
	SetRGBA(COLOR);

	// テクスチャ受け渡し
	BindTexture(m_pTexture);

	// 初期化
	CScene2d::Init();

	return S_OK;
}
//******************************************************************************
// 終了関数
//******************************************************************************
void CWarning::Uninit(void)
{
	//終了
	CScene2d::Uninit();
}
//******************************************************************************
// 更新関数
//******************************************************************************
void CWarning::Update(void)
{
	// 更新
	CScene2d::Update();

	// カラー取得
	D3DXCOLOR col = GetRGBA();

	// falseの場合
	if (m_bColor == false)
	{
		// α値減算
		col.a -= COLOR_ADD_VALUE;
		// 0.1以下になった場合
		if (col.a <= COLOR_MIN_VALUE)
		{
			// trueにする
			m_bColor = true;
		}
	}
	// trueの場合
	else
	{
		// α値加算
		col.a += COLOR_ADD_VALUE;
		// 1.0f以上の場合
		if (col.a >= COLOR_MAX_VALUE)
		{
			// falseにする
			m_bColor = false;
		}
		// インクリメント
		m_nWarnigCount++;
	}
	// 50の場合
	if (m_nWarnigCount == BOSS_RESPAWN_COUNT)
	{
		// ボス生成
		CGame::CreateBoss();

		// 終了
		Uninit();
		// 他の処理を通らないように
		return;
	}

	// カラー設定
	SetRGBA(col);
}
//******************************************************************************
// 描画関数
//******************************************************************************
void CWarning::Draw(void)
{
	// 描画
	CScene2d::Draw();
}