//******************************************************************************
// ブロック [block.h]
// Author : 管原　司
//******************************************************************************
#ifndef _OBJ_FLOOR_H_
#define _OBJ_FLOOR_H_

//******************************************************************************
// インクルードファイル
//******************************************************************************
#include "../3D/Model/Object/3d_obj.h"
//******************************************************************************
// マクロ定義
//******************************************************************************

//******************************************************************************
// 前方宣言
//******************************************************************************
class CModel;
//******************************************************************************
// プレイヤークラス
//******************************************************************************
class CFloor_Block :public C3D_Obj
{
public:
	// 種類
	enum TYPE
	{
		TYPE_NORMAL,
		TYPE_CHECK_POINT,
		TYPE_ENEMY_CREATE,
		TYPE_ENEMY,
		TYPE_END
	};
	CFloor_Block(int nPriority = OBJTYPE_MAP_OBJ);
	~CFloor_Block();

	static CFloor_Block *Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 size, TYPE type);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	TYPE GetType(void) { return m_Type; }
private:
	TYPE m_Type;	// タイプ
};

#endif