//******************************************************************************
// ボタン [button.h]
// Author : 管原　司
//******************************************************************************
#ifndef _OBJ_BUTTON_H_
#define _OBJ_BUTTON_H_

//******************************************************************************
// インクルードファイル
//******************************************************************************
#include "3d_obj.h"
//******************************************************************************
// マクロ定義
//******************************************************************************

//******************************************************************************
// 前方宣言
//******************************************************************************
class CModel;
//******************************************************************************
// プレイヤークラス
//******************************************************************************
class CButton :public C3D_Obj
{
public:
	CButton(int nPriority = OBJTYPE_BUTTON);
	~CButton();

	static CButton *Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 size);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	bool GetbPush(void) { return m_bPush; }
private:
	void Collision(void);
	void UnderMove(void);
	void UpMove(void);
	D3DXVECTOR3 m_SavePos;	// 位置保存用
	bool m_bPush;			// 移動判定
};

#endif